mdmfile/src/Catalogs/мдмБизнесПроцессы/мдмБизнесПроцессы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мдмБизнесПроцессы</name>
  <basedOn>Catalog.мдмСхемыДанных</basedOn>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.мдмБизнесПроцессы</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаДанных</name>
    <type>
      <types>CatalogRef.мдмСхемыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаДанных</name>
    <type>
      <types>CatalogRef.мдмФормыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСписка</name>
    <type>
      <types>CatalogRef.мдмНастройкиСписков</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПредмета</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмяМетаданныхПредмета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДанныхБизнесПроцесса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

mdmfile/src/CommonModules/мдмБизнесПроцессыВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ВзятьЗадачиВРаботу(Задачи) Экспорт
	
	мдмБизнесПроцессыСервер.ВзятьЗадачиВРаботу(Задачи);	
	
	Сообщить("Это локальные изменения");
	
КонецПроцедуры	

Процедура ПрерватьПроцессы(Задачи) Экспорт
	
	мдмБизнесПроцессыСервер.ПрерватьПроцессы(Задачи);	
	
КонецПроцедуры	

Функция КоличествоБизнесПроцессов(ПолноеИмяМетаданных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БизнесПроцессы.Ссылка) КАК Количество
		|ИЗ
		|	Справочник.мдмБизнесПроцессы КАК БизнесПроцессы
		|ГДЕ
		|	БизнесПроцессы.ПолноеИмяМетаданныхПредмета = &ПолноеИмяМетаданных
		|	И БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
		|	И БизнесПроцессы.Использовать";
	
	Запрос.УстановитьПараметр("ПолноеИмяМетаданных", ПолноеИмяМетаданных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Количество;
	
КонецФункции	

Функция БизнесПроцесс(ПолноеИмяМетаданных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БизнесПроцессы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.мдмБизнесПроцессы КАК БизнесПроцессы
		|ГДЕ
		|	БизнесПроцессы.ПолноеИмяМетаданныхПредмета = &ПолноеИмяМетаданных
		|	И БизнесПроцессы.ПометкаУдаления = ЛОЖЬ
		|	И БизнесПроцессы.Использовать";
	
	Запрос.УстановитьПараметр("ПолноеИмяМетаданных", ПолноеИмяМетаданных);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции	

#КонецОбласти
